# Pergunta: Para os ultimos 10 anos, em qual mês ocorrem mais ataques de tubarão nos EUA?

In [1]:
import pandas as pd

In [2]:
df=pd.read_csv('attacks.csv')

In [3]:
new_df=df[['Case Number','Date','Country']].copy()

In [4]:
new_df=new_df.loc[new_df['Country']=='USA']

In [5]:
#Primeira manipulação de string para separar o ano
my_date = [item.split('-') for item in new_df['Date']]

In [6]:
#Cria a lista de ano e converte para interiro, se não é possivel converter para inteiro cria a flag 0
my_year = [int(my_date[i][-1]) if my_date[i][-1].isdigit() else 0 for i in range(len(my_date))]

In [7]:
new_df['Year']=my_year

### Analisando os dados a partir da flag 0, podemos perceber que devido a varição na forma de input diversos anos não foram extraidos.
#### Opção 1: Reescrever o filtro para que ele capture mais dados. Por exemplo, um filtro que captura os 4 ultimos digitos da string.
#### Opção 2: Corrigir manualmente os dados relevantes.
#### Para o periodo desejado apenas 5 datas precisariam de correção, sendo assim, optei por fazer a correção manual

In [8]:
new_df.loc[new_df['Year']==0].head(10)

       Case Number           Date Country  Year
423     2015.05.20     20-May2015     USA     0
556     2014.05.13     13-May2014     USA     0
598     2013.11.29     29-Nov2013     USA     0
877   2011.08.24.b   24-Aug-2011      USA     0
878   2011.08.24.a   24-Aug-2011      USA     0
1298  2008.00.00.b      Fall 2008     USA     0
1357  2007.07.19.b  19-Jul-2007.b     USA     0
1462  2006.07.09.a   09-Jul-2006.     USA     0
1465  2006.06.30.b      July 2006     USA     0
1466  2006.06.30.a      July 2006     USA     0

In [9]:
#Correção Manual dos dados
new_df.loc[423]['Year']=2015
new_df.loc[423]['Date']='20-May-2015'

new_df.loc[556]['Year']=2014
new_df.loc[556]['Date']='13-May-2014'

new_df.loc[598]['Year']=2013
new_df.loc[598]['Date']='29-Nov-2013'

new_df.loc[877]['Year']=2011
new_df.loc[877]['Date']='24-Aug-2011'

new_df.loc[878]['Year']=2011
new_df.loc[878]['Date']='24-Aug-2011'

<ipython-input-9-f07e7f6200f0>:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  new_df.loc[423]['Year']=2015
<ipython-input-9-f07e7f6200f0>:3: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  new_df.loc[423]['Date']='20-May-2015'
<ipython-input-9-f07e7f6200f0>:5: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  new_df.loc[556]['Year']=2014
<ipython-input-9-f07e7f6200f0>:6: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  new_df.loc[556]['Date']='13-May-2014'
<ipython-input-9-f07e7f6200f0>:8: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  new_df.loc[598]['Year']=2013
<ipython-input-9-f07e7f6200f0>:9: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  new_df.loc[598]['Date']='29-Nov-2013'
<ipython-input-9-f07e7f6200f0>:11: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  new_df.loc[877]['Year']=2011
<ipython-input-9-f07e7f6200f0>:12: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  new_df.loc[877]['Date']='24-Aug-2011'
<ipython-input-9-f07e7f6200f0>:14: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  new_df.loc[878]['Year']=2011
<ipython-input-9-f07e7f6200f0>:15: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  new_df.loc[878]['Date']='24-Aug-2011'

In [10]:
#Filtro para descartar anos anteriores a 2011
new_df=new_df.loc[new_df['Year']>=2011]

In [11]:
#Segunda Manipulação de Datas para extrair o Mês
my_date2 = [item.split('-') for item in new_df['Date']]

In [12]:
my_month = [my_date2[i][-2] if len(my_date2[i])==3 else 0 for i in range(len(my_date2))]

In [13]:
new_df['Month']=my_month

### Analisando os dados a partir da flag 0, podemos perceber que devido a varição na forma de input diversos anos não foram extraidos. Novamente será feita uma correção manual.

In [14]:
new_df.loc[new_df['Month']==0]

      Case Number          Date Country  Year Month
588  2014.00.00.b          2014     USA  2014     0
802    2012.04.00      Apr-2013     USA  2013     0
885  2011.08.16.b  16-Aug--2011     USA  2011     0
888    2011.08.11  11-Aug--2011     USA  2011     0

In [15]:
new_df.loc[588]['Month']='00'
new_df.loc[588]['Date']='00-00-2014'

new_df.loc[802]['Month']='Apr'
new_df.loc[802]['Date']='00-Apr-2013'

new_df.loc[885]['Month']='Aug'
new_df.loc[885]['Date']='16-Aug-2011'

new_df.loc[888]['Month']='Aug'
new_df.loc[888]['Date']='11-Aug-2011'

<ipython-input-15-516ce8677ca6>:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  new_df.loc[588]['Month']='00'
<ipython-input-15-516ce8677ca6>:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  new_df.loc[588]['Date']='00-00-2014'
<ipython-input-15-516ce8677ca6>:4: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  new_df.loc[802]['Month']='Apr'
<ipython-input-15-516ce8677ca6>:5: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  new_df.loc[802]['Date']='00-Apr-2013'
<ipython-input-15-516ce8677ca6>:7: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  new_df.loc[885]['Month']='Aug'
<ipython-input-15-516ce8677ca6>:8: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  new_df.loc[885]['Date']='16-Aug-2011'
<ipython-input-15-516ce8677ca6>:10: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  new_df.loc[888]['Month']='Aug'
<ipython-input-15-516ce8677ca6>:11: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  new_df.loc[888]['Date']='11-Aug-2011'

In [16]:
# Verificação de duplicatas a partir do Case Number
new_df.duplicated('Case Number').sum()

3

In [17]:
new_df.loc[new_df.duplicated('Case Number')]

      Case Number         Date Country  Year Month
523    2014.08.02  02-Aug-2014     USA  2014   Aug
616    2013.10.05  10-Oct-2013     USA  2013   Oct
747  2012.09.02.b  02-Sep-2012     USA  2012   Sep

### A partir do DataFrame 'df' observa-se que apesar do Case Number estar duplicado, os casos tem informações divergentes entre si. Ou seja não se trata de casos duplicados mas sim de erro na numeração de case. Opto por manter todos os dados.

In [18]:
#Avaliação dos Case Number duplicados
df.loc[df['Case Number']=='2012.09.02.b']

,Case Number,Date,Year,Type,Country,Area,Location,Activity,Name,Sex,...,Species,Investigator or Source,pdf,href formula,href,Case Number.1,Case Number.2,original order,Unnamed: 22,Unnamed: 23
746,2012.09.02.b,02-Sep-2012,2012.0,Unprovoked,USA,Florida,"New Smyrna Beach, Volusia County",Boogie boarding,female,F,...,3.5' to 4' shark,"WYTV, 9/3/2012",2012.09.02.b-NSB-girl.pdf,http://sharkattackfile.net/spreadsheets/pdf_di...,http://sharkattackfile.net/spreadsheets/pdf_di...,2012.09.02.b,2012.09.02.b,5557.0,NaN,NaN
747,2012.09.02.b,02-Sep-2012,2012.0,Provoked,USA,Hawaii,"Spreckelsville, Maui",Spearfishing,M. Malabon,NaN,...,"Tiger shark, 10' to 12'",HawaiiNow.com,2012.09.02.c-Malabon.pdf,http://sharkattackfile.net/spreadsheets/pdf_di...,http://sharkattackfile.net/spreadsheets/pdf_di...,2012.09.02.b,2012.09.02.b,5556.0,NaN,NaN

### Ao agruparmos os casos por mês, è possivel observar que Setembro é o mês de amior incidência de ataques de tubarões

In [19]:
new_df.groupby('Month').count()

       Case Number  Date  Country  Year
Month
0                4     4        4     4
Apr             35    35       35    35
Aug             49    49       49    49
Dec             15    15       15    15
Feb              6     6        6     6
Jan             14    14       14    14
Jul             54    54       54    54
Jun             62    62       62    62
Mar             18    18       18    18
May             42    42       42    42
Nov             21    21       21    21
Oct             57    57       57    57
Sep             67    67       67    67

# Pergunta 2: Porque em setembro tem mais ataques de tubarão?
#### Hipoteses: É temporada de surf? Ocorreram multiplos ataques em  um dia especifico? É uma região especifica que tem a alta?

In [20]:
new_df.shape

(444, 5)

In [21]:
new2=pd.merge(new_df,df,on='Case Number')

In [22]:
new2.shape

(450, 28)

In [23]:
new2.duplicated().sum()

4

In [24]:
new2=new2.drop_duplicates()

In [25]:
new2.duplicated('Case Number').sum()

5

### Para a ano va avaliação foi necessário coletar mais dados a partir da tabela original 'df', para isso fez-se um merge e verificou-se as duplicatas.
#### Analisando os valores duplicados, opto por dropar as linhas totalmente duplicadas e manter as demais

In [26]:
new2.loc[new2.duplicated('Case Number')]

,Case Number,Date_x,Country_x,Year_x,Month,Date_y,Year_y,Type,Country_y,Area,...,Species,Investigator or Source,pdf,href formula,href,Case Number.1,Case Number.2,original order,Unnamed: 22,Unnamed: 23
249,2014.08.02,02-Aug-2014,USA,2014,Aug,02-Aug-2014,2014.0,Unprovoked,USA,Florida,...,NaN,"Florida Today, 8/2/2014",2014.08.02-Sanhueza.pdf,http://sharkattackfile.net/spreadsheets/pdf_di...,http://sharkattackfile.net/spreadsheets/pdf_di...,2014.08.02,2014.08.02,5780.0,NaN,NaN
289,2013.10.05,06-Oct-2013,USA,2013,Oct,10-Oct-2013,2013.0,Unprovoked,USA,Florida,...,Small bull shark,"Monroe County Advocate, 10/9/2013",2013.10.05-Standridge.pdf,http://sharkattackfile.net/spreadsheets/pdf_di...,http://sharkattackfile.net/spreadsheets/pdf_di...,2013.10.05,2013.10.05,5687.0,NaN,NaN
290,2013.10.05,10-Oct-2013,USA,2013,Oct,06-Oct-2013,2013.0,Unprovoked,USA,California,...,"White shark, 8' to 10'","R. Collier, GSAF",2013.10.06-Scrivner.pdf,http://sharkattackfile.net/spreadsheets/pdf_di...,http://sharkattackfile.net/spreadsheets/pdf_di...,2013.10.05,2013.10.05,5688.0,NaN,NaN
291,2013.10.05,10-Oct-2013,USA,2013,Oct,10-Oct-2013,2013.0,Unprovoked,USA,Florida,...,Small bull shark,"Monroe County Advocate, 10/9/2013",2013.10.05-Standridge.pdf,http://sharkattackfile.net/spreadsheets/pdf_di...,http://sharkattackfile.net/spreadsheets/pdf_di...,2013.10.05,2013.10.05,5687.0,NaN,NaN
363,2012.09.02.b,02-Sep-2012,USA,2012,Sep,02-Sep-2012,2012.0,Provoked,USA,Hawaii,...,"Tiger shark, 10' to 12'",HawaiiNow.com,2012.09.02.c-Malabon.pdf,http://sharkattackfile.net/spreadsheets/pdf_di...,http://sharkattackfile.net/spreadsheets/pdf_di...,2012.09.02.b,2012.09.02.b,5556.0,NaN,NaN

In [27]:
new2=new2[['Case Number', 'Date_x', 'Month', 'Area', 'Activity', 'Time']]

### Para uma primeira avaliação, verifico a ocorrencia de ataques de tubarão por atividade e comparo com as atividades em Setembro

In [28]:
new2.groupby('Activity').count().sort_values('Case Number', ascending=False).head(10)

                 Case Number  Date_x  Month  Area  Time
Activity
Surfing                  145     145    145   145   128
Swimming                  73      73     73    73    60
Wading                    21      21     21    21    21
Standing                  13      13     13    13    11
Spearfishing              12      12     12    12     7
Fishing                   11      11     11    11     7
Snorkeling                 9       9      9     9     9
Boogie boarding            9       9      9     9     8
Paddle boarding            6       6      6     6     6
Kayaking                   6       6      6     6     5

In [29]:
100*145/444 #parametro: ao todo os ataques de tubarão a surfistas correspondem a 32,657%

32.65765765765766

In [30]:
new2.loc[new2['Month']=='Sep'].groupby('Activity').count().sort_values('Case Number', ascending=False).head(10)

                             Case Number  Date_x  Month  Area  Time
Activity
Surfing                               33      33     33    33    33
Swimming                               8       8      8     8     6
Spearfishing                           4       4      4     4     3
Wading                                 2       2      2     2     2
Standing                               2       2      2     2     2
Kayak Fishing                          2       2      2     2     1
Boogie boarding                        2       2      2     2     2
Photographing fish                     1       1      1     1     1
Swimming or boogie boarding            1       1      1     1     1
Stand-Up Paddleboarding                1       1      1     1     1

In [31]:
100*33/67 #parametro: os ataques de tubarão a surfistas em setembro correspondem a 49.25%, ou seja superior a media

49.25373134328358

### Após verificar a que há uma alta de casos de ataques de tubarões a surfistas no mês de setembro, verifico se essa alta está relacionada a alguma região especifica.

In [32]:
new2.groupby('Area').count().sort_values('Case Number', ascending=False).head(10)

                Case Number  Date_x  Month  Activity  Time
Area
Florida                 211     211    211       195   172
Hawaii                   69      69     69        69    65
California               58      58     58        56    44
South Carolina           44      44     44        39    31
North Carolina           23      23     23        20    19
Texas                    12      12     12        12     9
Oregon                    6       6      6         6     3
Alabama                   5       5      5         4     2
Massachusetts             5       5      5         5     5
New Jersey                3       3      3         2     2

In [33]:
100*211/444 # 47.52% dos ataqes ocorreram na Florida

47.52252252252252

In [34]:
new2.loc[new2['Month']=='Sep'].groupby('Area').count().sort_values('Case Number', ascending=False).head(10)

                Case Number  Date_x  Month  Activity  Time
Area
Florida                  45      45     45        44    42
California                8       8      8         8     6
Hawaii                    5       5      5         5     5
South Carolina            4       4      4         2     3
Alabama                   1       1      1         1     1
Massachusetts             1       1      1         1     1
New York                  1       1      1         1     1
Puerto Rico               1       1      1         1     1
Texas                     1       1      1         1     0

### Observa-se que na Florida os casos sobem significativamente durante o mês de Setembro

In [35]:
100*45/67 # 67.16% dos ataqes em setembro ocorreram na Florida

67.16417910447761

### Por fim, analiso a ocorrncia de multiplos ataques no mesmo dia, para verificar se podem estar relacionados fazendo a media de ataques em setembro subir. Verifico que os ataques no mesmo dia não tem relação entre si.

In [37]:
new2.groupby('Date_x').count().sort_values('Case Number', ascending=False).head(10)

             Case Number  Month  Area  Activity  Time
Date_x
20-Sep-2015            4      4     4         4     4
14-Jun-2012            4      4     4         4     4
20-Jul-2017            3      3     3         3     2
26-Jun-2012            3      3     3         3     3
02-Sep-2012            3      3     3         3     3
02-Sep-2017            3      3     3         3     1
18-Sep-2016            3      3     3         3     3
25-Jun-2013            3      3     3         3     2
06-Oct-2013            2      2     2         2     2
26-Jul-2015            2      2     2         2     2

In [38]:
new2.loc[new2['Date_x']=='20-Sep-2015']

      Case Number       Date_x Month     Area            Activity   Time
159  2015.09.20.d  20-Sep-2015   Sep  Florida             Surfing  16h45
160  2015.09.20.c  20-Sep-2015   Sep   Hawaii        Spearfishing  15h52
161  2015.09.20.b  20-Sep-2015   Sep  Florida              Wading  12h30
162  2015.09.20.a  20-Sep-2015   Sep  Florida  Photographing fish  07h30

In [39]:
new2.loc[new2['Date_x']=='02-Sep-2012']

,Case Number,Date_x,Month,Area,Activity,Time
362,2012.09.02.b,02-Sep-2012,Sep,Florida,Boogie boarding,18h30
363,2012.09.02.b,02-Sep-2012,Sep,Hawaii,Spearfishing,12h00
366,2012.09.02.a,02-Sep-2012,Sep,Florida,Swimming or boogie boarding,16h30

In [40]:
new2.loc[new2['Date_x']=='02-Sep-2017']

     Case Number       Date_x Month     Area  Activity   Time
26  2017.09.02.c  02-Sep-2017   Sep  Florida  Swimming    NaN
27  2017.09.02.b  02-Sep-2017   Sep    Texas  Swimming    NaN
28  2017.09.02.a  02-Sep-2017   Sep  Florida   Surfing  10h44

In [41]:
new2.loc[new2['Date_x']=='18-Sep-2016']

     Case Number       Date_x Month     Area Activity   Time
85  2016.09.18.c  18-Sep-2016   Sep  Florida  Surfing  13h00
86  2016.09.18.b  18-Sep-2016   Sep  Florida  Surfing  11h00
87  2016.09.18.a  18-Sep-2016   Sep  Florida  Surfing  10h43

## Hipotese: Com a temporada de surfistas iniciantes e antes das quedas de temperatura

### https://getaway.10best.com/13559085/when-is-shark-season-in-florida
### https://usa-bubusa.com/florida/when-is-shark-season-in-florida.html
### https://rove.me/to/florida/surfing#:~:text=The%20sun%20is%20shining%20and%20the%20water%20stays,low%20pressures%2C%20generating%20waves%20up%20to%20three%20meters.